var a = 0;
var Q = ["承上題，下列何者為無效論證（也就是說在相同前提下可能有違反結論的結果產生）？", "下列哪一種「定義」的方式最為完整？", "「說服性定義」是一種重點不在於完整描述被定義項的性質，而是企圖去影響其他人對於該項事物的好惡想法的一種定義，下列哪一項即是屬於說服式定義的一種？", "甲：「我認為孩童不應該往大街上亂跑。」乙：「 把小孩關起來， 不讓他們呼吸新鮮空氣， 那真是太愚蠢了。」由甲和乙的對話判斷， 乙犯了下列哪一種的非形式謬誤。", "甲：「你兒子很聰明捏，聽說他去年考上台大了捏，好厲害喔，可不可以請他幫忙看一下我手上這幾支股票有哪支會大漲。」乙：「謝謝你的讚美，可是我兒子讀的是哲學系…」由甲和乙的對話判斷，甲犯了下列哪一種的非形式謬誤。", "小明：「我一句中文都不會講，這次去中國多照顧照顧啊。」由小明對話判斷，小明犯了下列哪一種的非形式謬誤。", "命題係指可以判斷真假值的語句，然而有幾種情況下有一些語句會造成真假值判斷的困難，因此較不建議作為邏輯命題使用，像是富含情感價值的語句、知識理論上的差異、無精確定義時間的未來事件和空論域等等。其中空論域的意思是指命題所描述的對象並不存在於現實世界之中，請問下列哪一項語句中涉及空論域的問題？", "下列哪兩句話彼此是互為矛盾句的（意思是這兩句話不可能同時為真，且不可能同時為假）？", "下列哪兩句話彼此的關係是錯誤的？"];
var c1 = ["所有的獨角獸都有角（前提一），所以有些獨角獸有角（結論）。", "日蝕指的是「月球在行經地球與太陽之間，將部分或全部陽光遮擋住的天文現象」。", "前端程式設計是指「一門富知識性且十分有趣的課程」。", "錯誤類比的謬誤：藉由比較兩件不同事物在某些方面的共同點，來推論這兩件不同事物在另外一些方面也必然相同。係使用不恰當的類比推論而得出不恰當的結論。", "錯誤因果的謬誤：泛指各種未有充分證據便輕率斷定因果關係的不當推論。", "證明不存在的謬誤：要求對方證明某事物不存在，否則就得承認某事物存在。", "屋子裡的海妖喜歡聽音樂", "肺炎疫情爆發會導致全球死亡人數增加、肺炎疫情爆發或奧運如期舉辦", "「所有A都是B」與「沒有A是B」彼此可以同時為假，不可同時為真。"]
var c2 = ["他不可能同時比我高且比我矮（前提一），他的身高沒有比我高（前提二），所以他一定比我矮（結論）。", "寵物指的是「人類在家中養的貓狗」。", "校長是指「一所學校掌管行政、業務的最高主要負責人」。", "訴諸情感的謬誤：藉由操縱人們的情感，而非有效的邏輯，以求贏得爭論的論證方式。", "訴諸假權威的謬誤：主張某專家支持某事，因此某事是對的，但該專家說法的可靠性令人懷疑。", "前提矛盾的謬誤：宣稱的命題自我衝突或自我推翻而缺乏說服力。", "前端程式設計的其中一位助教喜歡吃楊桃", "吃下這顆藥後阿婆的背就不痛了、現在阿婆的背不痛且阿婆沒吃藥", "「有些A是B」與「有些A不是B」彼此可以同時為真，不可以同時為假。"]
var c3 = ["人都會死（前提一），系主任是黃種人（前提二），黃種人也是人（前提三），所以系主任會死（結論）。", "音樂家指的是「演奏音樂的人」。", "二一是指「在大學某一學期因為部分學科不及格，導致有1/2以上的學分數無法拿到。」", "稻草人的謬誤：曲解對方的論點，再以曲解後的論點進行反擊，並宣稱推翻對方的論點。", "人身攻擊的謬誤：宣稱某人有某些負面特質，以明示或暗示其主張不可取。", "恆真句式謬誤：把論述中關鍵詞的意義換成自訂定義，使原論述語義上恆真，卻空洞無內容。", "雞會游泳", "這雙綠色的鞋子再鞋櫃裡、這雙綠色的鞋子不再鞋櫃裡。", "「有些A是B」與「沒有A是B」彼此可能同時為真。"]
var color1 = ["red", "red", "green", "green", "red", "red", "red", "green", "red", "red"]
var color2 = ["red", "green", "red", "red", "red", "green", "green", "red", "red", "red"]
var color3 = ["green", "red", "red", "red", "green", "red", "red", "red", "green", "green"]
var wrong = 0;
var count = 0;

$(() => {
    $('#read').hide();
    $('#quiz').hide();
    $('#end').hide();
    $("#rule").on('click', () => {
        $('#start').hide();
        $('#read').show();
    })

    $("*#begin").on('click', () => {
        $('#start').remove();
        $('#read').remove();
        $('#quiz').show();
        $('#title').prepend($("<h1></h1>").text("Q1."));
    })

    $("#Next").on('click', () => {
        if (a < 9) {
            $(".choice").css({ "background-color": "coral" })
            var b = a + 2
            $('h1:first').text("Q" + b + ".")
            $('#Q').text(Q[a])
            $('#c1').text("1.   " + c1[a])
            $('#c2').text("2.   " + c2[a])
            $('#c3').text("3.   " + c3[a])
            a += 1
            if (a === 9) {
                $('#Next').text('結果')
            }
        } else {
            $('#quiz').remove()
            $('#end').show()
            $('#end').append($("<h1></h1>").text((1 - wrong / count) * 100 + "%"))
            if ((1 - wrong / count) <= 0.3) {
                $("#end").append($("<h1></h1>").text("需加強邏輯訓練"))
            } else if ((1 - wrong / count) <= 0.7) {
                $("#end").append($("<h1></h1>").text("具一般邏輯素養"))
            } else {
                $("#end").append($("<h1></h1>").text("邏輯大師"))
            }
        }
    })

    $("#c1").on('click', () => {
        $("#c1").css({ "background-color": color1[a], "border-radius": "10px" })
        if (color1[a] === 'red') {
            wrong += 1
        }
        count += 1
    })

    $("#c2").on('click', () => {
        $("#c2").css({ "background-color": color2[a], "border-radius": "10px" })
        if (color2[a] === 'red') {
            wrong += 1
        }
        count += 1
    })

    $("#c3").on('click', () => {
        $("#c3").css({ "background-color": color3[a], "border-radius": "10px" })
        if (color3[a] === 'red') {
            wrong += 1
        }
        count += 1
    })
})